<?php

// Optionally define the filesystem path to your system fonts
// otherwise tFPDF will use [path to tFPDF]/font/unifont/ directory
// define("_SYSTEM_TTFONTS", "C:/Windows/Fonts/");


$classpathFPDF=$root_path.'classes/fpdf/';
$fontpathFPDF=$classpathFPDF.'font/unifont/';
define("_SYSTEM_TTFONTS",$fontpathFPDF);

include_once($classpathFPDF.'tfpdf.php');
//----------------


$tpdf = new tFPDF('P','mm','a4');
$tpdf->AddPage();
$tpdf->SetTitle('Giay chung nhan suc khoe');
$tpdf->SetAuthor('Vien KH-CN VN - Phong CN Tinh Toan & CN Tri Thuc');
$tpdf->SetRightMargin(15);
$tpdf->SetLeftMargin(15);
$tpdf->SetTopMargin(20);
$tpdf->SetAutoPageBreak('true','15');


// Add a Unicode font (uses UTF-8)
$tpdf->AddFont('DejaVu','','DejaVuSansCondensed.ttf',true);
$tpdf->AddFont('DejaVu','B','DejaVuSansCondensed-Bold.ttf',true);
$tpdf->AddFont('DejaVu','I','DejaVuSansCondensed-Oblique.ttf',true);
$tpdf->AddFont('DejaVu','IB','DejaVuSansCondensed-BoldOblique.ttf',true);


$tpdf->SetFont('DejaVu','B',11);
$tpdf->Ln(); 
$y=$tpdf->GetY();

$tpdf->Cell(40,7,'BỘ Y TẾ',0,0,'C');
$tpdf->Cell(0,7,'CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM',0,1,'C');
$tpdf->Cell(40,6,'SỞ Y TẾ',0,0,'C');
$tpdf->Cell(0,6,'Độc lập - Tự Do - Hạnh Phúc',0,1,'C');
$tpdf->Cell(40,6,' ',0,0,'C');
$tpdf->Cell(0,6,'----------***----------',0,1,'C');
$tpdf->SetFont('','BI');
$tpdf->UnderlineText(true);
$tpdf->Cell(40,6,'Đơn vị y tế:',0,1,'C');


$tpdf->SetFont('DejaVu','B',18);
$tpdf->Ln(); 
$tpdf->Cell(0,7,'GIẤY CHỨNG NHẬN SỨC KHỎE',0,1,'C');
$tpdf->SetFont('','I',12);
$tpdf->Cell(0,6,'(Điều khiển các phương tiện giao thông cơ giới)',0,1,'C');
$tpdf->Ln(10);

//Thông tin bệnh nhân
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'Họ và tên:.....................................................................................Bí danh:................................',0,1,'L');
$tpdf->Cell(0,6,'Ngày tháng năm sinh:................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'Cơ quan công tác:......................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'Quê quán:..................................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'Nơi ĐKHK thường trú:.................................................................................................................',0,1,'L');

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'I. TIỂU SỬ BẢN THÂN',0,1,'C');
$tpdf->SetFont('','');

for($i=0;$i<2;$i++)
{
	$tpdf->Cell(0,6,'...................................................................................................................................................',0,1,'R');
}

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'II. KHÁM',0,1,'C');
$tpdf->Cell(0,6,'1. Thể lực:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(50,6,'- Chiều cao',0,0,'L');
$tpdf->Cell(0,6,': .......................cm            Cân nặng: .....................kg',0,1,'L');
$tpdf->Cell(50,6,'- Vòng ngực trung bình',0,0,'L');
$tpdf->Cell(0,6,': ..................................................................cm',0,1,'L');
$tpdf->Cell(50,6,'- Lực bóp tay thuận',0,0,'L');
$tpdf->Cell(0,6,': ..................................................................kg',0,1,'L');
$tpdf->Cell(50,6,'- Tay không thuận',0,0,'L');
$tpdf->Cell(0,6,': ..................................................................kg',0,1,'L');
$tpdf->Cell(50,6,'- Lực kéo thân',0,0,'L');
$tpdf->Cell(0,6,': ..................................................................kg',0,1,'L');

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'2. Mắt:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(25,6,'- Thị lực:',0,0,'L');
$tpdf->MultiCell(0,6,"Mắt phải không kính ......................................có kính..........................................
Mắt trái không kính ........................................có kính..........................................
Kính loại: ..............................................................Số ..........................................",0,'L');
$tpdf->Cell(0,6,'- Sắc giác:...............................................................................................................................m',0,1,'L');
$tpdf->Cell(0,6,'- Bệnh ở mắt:..........................................................................................................................m',0,1,'L');

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'3. Tai - Mũi - Họng:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'- Tai phải nghe nói thường cách .............................................................................................m',0,1,'L');
$tpdf->Cell(0,6,'nghe nói thầm thì cách ...........................................................................................................m',0,1,'L');
$tpdf->Cell(0,6,'- Tai trái nghe nói thường cách ...............................................................................................m',0,1,'L');
$tpdf->Cell(0,6,'nghe nói thầm thì cách ...........................................................................................................m',0,1,'L');
$tpdf->Cell(0,6,'- Bệnh tai: ..................................................................................................................................',0,1,'L');

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'4. Răng - Hàm - Mặt:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'- Hàm trên: ................................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Hàm dưới: ................................................................................................................................',0,1,'L');


$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'5. Tâm thần kinh:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'- Động kinh: .................................................... Tê liệt................................................................',0,1,'L');
$tpdf->Cell(25,6,'- Phản xạ:',0,0,'L');
$tpdf->MultiCell(0,6,"Tay\nChân",0,'L');
$tpdf->Cell(0,6,'- Các bệnh về thần kinh: ............................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Các bệnh về tâm thần: .............................................................................................................',0,1,'L');

$tpdf->SetFont('','B');
$tpdf->Cell(40,6,'6. Tuần hoàn:',0,0,'L');
$tpdf->SetFont('','');
$tpdf->Cell(60,6,'Đo lần 1',0,0,'L');
$tpdf->Cell(60,6,'Đo lần 1',0,1,'L');
$tpdf->Cell(40,6,'- Mạch:',0,0,'L');
$tpdf->Cell(60,6,'Đo lần 2',0,0,'L');
$tpdf->Cell(60,6,'Đo lần 2',0,1,'L');
$tpdf->Cell(0,6,'- Huyết áp tối đa: Đo lần 3.......................... tối thiểu........................ Đo lần 3........................... ',0,1,'L');
$tpdf->Cell(0,6,'- Bệnh tim: .................................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Bệnh mạch máu: .....................................................................................................................',0,1,'L');


$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'7. Vận động:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'- Khớp: .......................................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Xương cơ: ................................................................................................................................',0,1,'L');

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'8. Các bệnh khác:',0,1,'L');
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'- Hô hấp: ....................................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Tiêu hóa: .................................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Tiết niệu sinh dục: ...................................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Bệnh ngoài da hoa liễu: ...........................................................................................................',0,1,'L');
$tpdf->Cell(0,6,'- Các bộ phận khác: ...................................................................................................................',0,1,'L');


$tpdf->SetFont('','B');
$tpdf->Cell(70,6,'9. Các xét nghiệm cận lâm sàng: ',0,0,'L');
$tpdf->SetFont('','');
$tpdf->Cell(0,6,'.........................................................................................',0,1,'R');
$tpdf->Cell(0,6,'...................................................................................................................................................',0,1,'R');

$tpdf->SetFont('','B');
$tpdf->Cell(0,6,'III. KẾT LUẬN',0,1,'C');
$tpdf->SetFont('','');
$tpdf->MultiCell(0,6,"(Có đủ điều kiện sức khỏe để điều khiển các phương tiện giao thông cơ giới không?\nĐiều khiển được loại phương tiện nào?)",0,'L');
for($i=0;$i<2;$i++)
{
	$tpdf->Cell(0,6,'...................................................................................................................................................',0,1,'R');
}

//Ký tên
$tpdf->Cell(90,6,' ',0,0,'C');
$tpdf->SetFont('','B');
$tpdf->Cell(0,6,"Trưởng Đoàn Khám",0,1,'C');
$tpdf->SetFont('','I');
$tpdf->Cell(90,6,' ',0,0,'C');
$tpdf->Cell(0,6,'(Ký tên, đóng dấu, ghi rõ họ tên)',0,1,'C');
$tpdf->Cell(0,50,' ',0,1,'C');

$tpdf->MultiCell(0,6,"Ghi chú: Các bác sĩ khám sức khỏe cấp giấy chứng nhận cho người điều khiển các phương tiện giao thông cơ giới cần nghiên cứu kỹ \"Tiêu chuẩn sức khỏe người điều khiển các phương tiện giao thông cơ giới\" đã được ban hành theo quyết định số 4-132/QĐ-BYT ngày 04 tháng 10 năm 2001 của Bộ Y Tế.",0,'L');


//$tpdf->Output();
$tpdf->Output('GiayChungNhanSucKhoe.pdf', 'I');


?>
